# IMDB Project Part 3B
- *David Atkins*

### Setup

In [56]:
import json
import sqlalchemy
sqlalchemy.__version__
# imports
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *
pd.set_option('display.max_columns',50)
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)
# In case my password uses special characters
from urllib.parse import quote_plus

In [57]:
with open('/Users/gondr/.secret/mysql_cred.json') as cred:
    login = json.load(cred)
login.keys()

dict_keys(['username', 'password'])

In [58]:
# Creating the sqlalchemy engine and connection
username = login['username']
password = login['password']
# password = quote_plus("Myp@ssword!") # If I have special chars in password
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [61]:
# Preemptively changing the setting for FOREIGN_KEY_CHECKS
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)
# Confirming
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     0

### Creating New Table DataFrames

In [23]:
basics = pd.read_csv('Data/basics_filtered.csv')
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [24]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]

In [25]:
genres_split = basics['genres_split']

unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Biography', 'Mystery', 'Musical', 'Action', 'Adventure', 'Crime',
       'Thriller', 'Music', 'Animation', 'Family', 'History', 'War',
       'Sport', 'Western', 'Adult', 'Reality-TV', 'News', 'Talk-Show',
       'Game-Show'], dtype=object)

In [26]:
exploded_genres = basics.explode('genres_split')
exploded_genres.info()
exploded_genres.head(3)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 162600 entries, 0 to 86978
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          162600 non-null  object
 1   titleType       162600 non-null  object
 2   primaryTitle    162600 non-null  object
 3   originalTitle   162600 non-null  object
 4   isAdult         162600 non-null  int64
 5   startYear       162600 non-null  float64
 6   endYear         0 non-null       float64
 7   runtimeMinutes  162600 non-null  int64
 8   genres          162600 non-null  object
 9   genres_split    162600 non-null  object
dtypes: float64(2), int64(2), object(6)
memory usage: 13.6+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance

In [39]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head(3)

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance

In [40]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Comedy': 0,
 'Fantasy': 1,
 'Romance': 2,
 'Drama': 3,
 'Horror': 4,
 'Sci-Fi': 5,
 'Biography': 6,
 'Mystery': 7,
 'Musical': 8,
 'Action': 9,
 'Adventure': 10,
 'Crime': 11,
 'Thriller': 12,
 'Music': 13,
 'Animation': 14,
 'Family': 15,
 'History': 16,
 'War': 17,
 'Sport': 18,
 'Western': 19,
 'Adult': 20,
 'Reality-TV': 21,
 'News': 22,
 'Talk-Show': 23,
 'Game-Show': 24}

In [41]:
title_genres['genres_split'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.rename(columns={'genres_split':'genre_id'})
title_genres.head(3)

      tconst  genre_id
0  tt0035423         0
0  tt0035423         1
0  tt0035423         2

In [44]:
genre_lookup = pd.DataFrame({'genre_name': genre_map.keys(), 'genre_id':genre_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Comedy         0
1    Fantasy         1
2    Romance         2
3      Drama         3
4     Horror         4

### Saving Genre Data to MySQL

In [54]:
tconst_max_len = title_genres['tconst'].fillna('').map(len).max()
genre_name_max_len = genre_lookup['genre_name'].fillna('').map(len).max()

print('title_genres dypes:')
print(title_genres.dtypes)
print(f'max tconst string length: {tconst_max_len}')
print('\ngenre_lookup dypes:')
print(genre_lookup.dtypes)
print(f'max genre_name string length: {genre_name_max_len}')

title_genres dypes:
tconst      object
genre_id     int64
dtype: object
max tconst string length: 10

genre_lookup dypes:
genre_name    object
genre_id       int64
dtype: object
max genre_name string length: 10

In [63]:
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, conn)
describe

      Field         Type Null  Key Default Extra
0    tconst  varchar(10)   NO  PRI    None
1  genre_id          int   NO  PRI    None

In [62]:
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [65]:
# inserting data
title_genres.to_sql("title_genres",conn,index=False, if_exists='append')

162600

In [71]:
# describe
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, conn)
describe

      Field         Type Null  Key Default Extra
0    tconst  varchar(10)   NO  PRI    None
1  genre_id          int   NO  PRI    None

In [67]:
# confirming data has been added
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q,conn)

      tconst  genre_id
0  tt0035423         0
1  tt0035423         1
2  tt0035423         2
3  tt0062336         3
4  tt0069049         3

In [68]:
# inserting data
genre_lookup.to_sql("genres",conn,index=False, if_exists='append')

25

In [70]:
# describe
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [69]:
# confirming data has been added
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q,conn)

   genre_id genre_name
0         0     Comedy
1         1    Fantasy
2         2    Romance
3         3      Drama
4         4     Horror

### Creating TMDB table

In [77]:
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb.info()
tmdb.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 257 entries, 0 to 256
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                257 non-null    object
 1   adult                  255 non-null    float64
 2   backdrop_path          215 non-null    object
 3   belongs_to_collection  42 non-null     object
 4   budget                 255 non-null    float64
 5   genres                 255 non-null    object
 6   homepage               44 non-null     object
 7   id                     255 non-null    float64
 8   original_language      255 non-null    object
 9   original_title         255 non-null    object
 10  overview               255 non-null    object
 11  popularity             255 non-null    float64
 12  poster_path            247 non-null    object
 13  production_companies   255 non-null    object
 14  production_countries   255 non-null    object
 15  release_date           254 non-null    object
 16  revenue                255 non-null    float64
 17  runtime                255 non-null    float64
 18  spoken_languages       255 non-null    object
 19  status                 255 non-null    object
 20  tagline                205 non-null    object
 21  title                  255 non-null    object
 22  video                  255 non-null    float64
 23  vote_average           255 non-null    float64
 24  vote_count             255 non-null    float64
 25  certification          179 non-null    object
dtypes: float64(9), object(17)
memory usage: 52.3+ KB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0118589,0.0,/9NZAirJahVilTiDNCHLFcdkwkiy.jpg,NaN,22000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",NaN,10696.0,en,Glitter,"A young woman is catapulted into pop stardom, ...",11.213,/b8gKsXB6d60SC2HKUcAAzTacn0S.jpg,"[{'id': 89627, 'logo_path': None, 'name': 'Gli...","[{'iso_3166_1': 'US', 'name': 'United States o...",2001-09-21,5271666.0,104.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"In music she found her dream, her love, herself.",Glitter,0.0,4.405,132.0,PG-13
2,tt0118652,0.0,/mWxJEFRMvkG4UItYJkRDMgWQ08Y.jpg,NaN,1000000.0,"[{'id': 27, 'name': 'Horror'}, {'id': 9648, 'n...",NaN,17140.0,en,The Attic Expeditions,Trevor Blackburn is accused of murdering his g...,4.178,/b0p8CjMLWc7B1nnIfFQ2uY3HLe0.jpg,"[{'id': 3260, 'logo_path': None, 'name': 'Tse ...","[{'iso_3166_1': 'US', 'name': 'United States o...",2001-03-30,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,His search for peace of mind... will leave his...,The Attic Expeditions,0.0,5.194,31.0,R

In [78]:
temp_tmdb = tmdb.drop(columns=['adult',
                               'backdrop_path',
                               'belongs_to_collection',
                               'genres',
                               'homepage',
                               'id',
                               'original_language',
                               'original_title', 
                               'overview', 
                               'popularity',
                               'poster_path',
                               'production_companies',
                               'production_countries', 
                               'release_date',
                               'runtime',
                               'spoken_languages',
                               'status', 
                               'tagline',
                               'title', 
                               'video',
                               'vote_average',
                               'vote_count'])

temp_tmdb.head()

     imdb_id      budget     revenue certification
0          0         NaN         NaN           NaN
1  tt0118589  22000000.0   5271666.0         PG-13
2  tt0118652   1000000.0         0.0             R
3  tt0119004         0.0      6297.0           NaN
4  tt0120681  35000000.0  74558110.0             R

In [92]:
id_max_len = temp_tmdb['imdb_id'].fillna('').map(len).max()
cert_max_len = genre_lookup['genre_name'].fillna('').map(len).max()

print(f'max imdb_id string length: {id_max_len}')
print(f'max certification string length: {cert_max_len}')

max imdb_id string length: 9
max certification string length: 10

In [93]:
tmdb_schema = {
    'imdb_id':CHAR(id_max_len+1),
    'revenue':FLOAT(),
    'budget':FLOAT(),
    'certification':VARCHAR(cert_max_len+1)}
tmdb_schema

{'imdb_id': CHAR(length=10),
 'revenue': FLOAT(),
 'budget': FLOAT(),
 'certification': VARCHAR(length=11)}

In [97]:
# Save to sql with dtype and index=False
temp_tmdb.to_sql('tmdb_data',conn, dtype=tmdb_schema, if_exists='replace',index=False)

256

In [98]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [99]:
# describe
q = '''DESCRIBE tmdb_data;'''
describe = pd.read_sql(q, conn)
describe

           Field         Type Null  Key Default Extra
0        imdb_id     char(10)   NO  PRI    None
1         budget        float  YES         None
2        revenue        float  YES         None
3  certification  varchar(11)  YES         None

In [101]:
# confirming data has been added
q = """SELECT * FROM tmdb_data LIMIT 5;"""
pd.read_sql(q,conn)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0118589  22000000.0   5271670.0         PG-13
2  tt0118652   1000000.0         0.0             R
3  tt0119004         0.0      6297.0          None
4  tt0120679  12000000.0  56298500.0             R

### Show Tables

In [103]:
# SHOW TABLES 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data